W7D2/MusicApp/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = User.find_by(email, password)
---
SELECT  "users".* FROM "users" WHERE (jason@jason.com) LIMIT $1  [["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "CKEN29WRBLPEFMZCwEExrA"], ["updated_at", "2020-05-19 22:21:17.381394"], ["id", 1]]