W7D3/Target/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1SUnf-ImK5mKgZaU4fNvyg"], ["updated_at", "2020-05-20 23:56:53.899750"], ["id", 1]]