W6D4/art_share_api/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("artist_id", "title", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 3], ["title", "history keeps me awake at night"], ["image_url", "www.davidwoscijencz.com"], ["created_at", "2020-05-14 18:58:32.259376"], ["updated_at", "2020-05-14 18:58:32.259376"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy