W6D4/art_share_api/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "laura"], ["created_at", "2020-05-14 18:56:21.212377"], ["updated_at", "2020-05-14 18:56:21.212377"]]

    def destroy
        user = User.find(params[:id])
        user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]