W7D3/Target/app/views/users/show.html.erb

<ul>
    <% @user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]