W6D5/cats_99/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create
        @cat = Cat.new(cat_params)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "birth_date" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "calico"], ["birth_date", "2019-03-05"], ["description", "older lina"], ["updated_at", "2020-05-15 23:37:01.154699"], ["id", 13]]