W7D3/Target/app/controllers/goals_controller.rb

    def create
        @goal = Goal.new(params.require(:goal).permit(:title, :body, :private))
        @goal.user_id = current_user.id
        if @goal.save
---
INSERT INTO "goals" ("body", "user_id", "title", "private", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Do stuff"], ["user_id", 1], ["title", "Sample Goal"], ["private", true], ["created_at", "2020-05-20 23:58:54.681030"], ["updated_at", "2020-05-20 23:58:54.681030"]]